DLT Workshop Homework

In [2]:
# Q1
def square_root_generator(limit): 
    n = 1 
    while n <= limit: 
        yield n ** 0.5 
        n += 1 

limit = 5
generator = square_root_generator(limit)

sum = 0
for sqrt_value in generator: 
    print(sqrt_value)
    sum += sqrt_value
    
print(sum)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
8.382332347441762

In [6]:
# Q2
def square_root_generator(limit): 
    n = 1 
    while n <= limit: 
        yield n ** 0.5 
        n += 1 
 
limit = 13
generator = square_root_generator(limit)

for sqrt_value in generator: 
    print(sqrt_value)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
2.449489742783178
2.6457513110645907
2.8284271247461903
3.0
3.1622776601683795
3.3166247903554
3.4641016151377544
3.605551275463989

In [7]:
# Q3
from itertools import chain

def people_1():
    for i in range(1, 6):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 25 + i, "City": "City_A"}

def people_2():
    for i in range(3, 9):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 30 + i, "City": "City_B", "Occupation": f"Job_{i}"}


age_sum = 0
for person in chain(people_1(),people_2()):
    print(person)
    age_sum += person['Age']
    
print(age_sum)

{'ID': 1, 'Name': 'Person_1', 'Age': 26, 'City': 'City_A'}
{'ID': 2, 'Name': 'Person_2', 'Age': 27, 'City': 'City_A'}
{'ID': 3, 'Name': 'Person_3', 'Age': 28, 'City': 'City_A'}
{'ID': 4, 'Name': 'Person_4', 'Age': 29, 'City': 'City_A'}
{'ID': 5, 'Name': 'Person_5', 'Age': 30, 'City': 'City_A'}
{'ID': 3, 'Name': 'Person_3', 'Age': 33, 'City': 'City_B', 'Occupation': 'Job_3'}
{'ID': 4, 'Name': 'Person_4', 'Age': 34, 'City': 'City_B', 'Occupation': 'Job_4'}
{'ID': 5, 'Name': 'Person_5', 'Age': 35, 'City': 'City_B', 'Occupation': 'Job_5'}
{'ID': 6, 'Name': 'Person_6', 'Age': 36, 'City': 'City_B', 'Occupation': 'Job_6'}
{'ID': 7, 'Name': 'Person_7', 'Age': 37, 'City': 'City_B', 'Occupation': 'Job_7'}
{'ID': 8, 'Name': 'Person_8', 'Age': 38, 'City': 'City_B', 'Occupation': 'Job_8'}
353

In [15]:
# Q4
import dlt
import duckdb

generators = dlt.pipeline(destination='duckdb', dataset_name='generators_dataset')

info = generators.run(people_1(),
							table_name="test",
							write_disposition="replace",
                            primary_key="id")
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.22 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators_dataset
The duckdb destination used duckdb:///d:\code\PLAYGROUND\dlt\dlt_ipykernel_launcher.duckdb location to store data
Load package 1708010734.683862 is LOADED and contains no failed jobs

In [11]:
# Q4 - Continued
conn = duckdb.connect(f"{generators.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators.dataset_name}'")

people1 = conn.sql("SELECT * FROM test").df()
display(people1)

   id      name  age    city        _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708010495.8292468  YMFD179pnm67Fw
1   2  Person_2   27  City_A  1708010495.8292468  otclbqBAA/+tBA
2   3  Person_3   28  City_A  1708010495.8292468  37aBwVCNm79Bmw
3   4  Person_4   29  City_A  1708010495.8292468  TgAtLklHhtGx9g
4   5  Person_5   30  City_A  1708010495.8292468  NkrOirpjKjw5WQ

In [12]:
# Q4 - Continued
generators.run(people_2(),
					table_name="test",
					write_disposition="merge",
                    primary_key="id")

merged_people = conn.sql("SELECT * FROM test").df()
display(merged_people)

   id      name  age    city        _dlt_load_id         _dlt_id occupation
0   1  Person_1   26  City_A  1708010495.8292468  YMFD179pnm67Fw       None
1   2  Person_2   27  City_A  1708010495.8292468  otclbqBAA/+tBA       None
2   5  Person_5   35  City_B    1708010629.55912  +fhKZmyF4BnMXA      Job_5
3   8  Person_8   38  City_B    1708010629.55912  0hCUvlRe50Evig      Job_8
4   3  Person_3   33  City_B    1708010629.55912  EimNlrxK+6fKGA      Job_3
5   6  Person_6   36  City_B    1708010629.55912  QUDyMINuHtkwUA      Job_6
6   4  Person_4   34  City_B    1708010629.55912  OibDrmKWYPk2SQ      Job_4
7   7  Person_7   37  City_B    1708010629.55912  OpcLm99sbVTs1Q      Job_7

In [14]:
# Q4 - Continued
age_sum = conn.sql("SELECT SUM(age) FROM test").df()
display(age_sum)

   sum(age)
0     266.0